//https://primefaces.org/primevue/showcase/#/locale

export const primeVueLocale = {
  accept: "לְקַבֵּל",
  reject: "לִדחוֹת",
  choose: "בחר",
  upload: "העלה",
  cancel: "לְבַטֵל",
  dayNames: [
    "יוֹם רִאשׁוֹן",
    "יוֹם שֵׁנִי",
    "יוֹם שְׁלִישִׁי",
    "יום רביעי",
    "יוֹם חֲמִישִׁי",
    "יוֹם שִׁישִׁי",
    "יום שבת"
  ],
  dayNamesShort: [
    "יוֹם רִאשׁוֹן",
    "יוֹם שֵׁנִי",
    "יוֹם שְׁלִישִׁי",
    "יום רביעי",
    "יוֹם חֲמִישִׁי",
    "יוֹם שִׁישִׁי",
    "יום שבת"
  ],
  dayNamesMin: [
    "יוֹם רִאשׁוֹן",
    "יוֹם שֵׁנִי",
    "יוֹם שְׁלִישִׁי",
    "יום רביעי",
    "יוֹם חֲמִישִׁי",
    "יוֹם שִׁישִׁי",
    "יום שבת"
  ],
  monthNames: [
    "יָנוּאָר",
    "פברואר",
    "מרץ",
    "אַפּרִיל",
    "מאי",
    "יוני",
    "יולי",
    "אוגוסט",
    "סֶפּטֶמבֶּר",
    "אוֹקְטוֹבֶּר",
    "נוֹבֶמבֶּר",
    "דֵצֶמבֶּר"
  ],
  monthNamesShort: [
    "יָנוּאָר",
    "פברואר",
    "מרץ",
    "אַפּרִיל",
    "מאי",
    "יוני",
    "יולי",
    "אוגוסט",
    "סֶפּטֶמבֶּר",
    "אוֹקְטוֹבֶּר",
    "נוֹבֶמבֶּר",
    "דֵצֶמבֶּר"
  ],
  today: "היום",
  weekHeader: "שָׁבוּעַ",
  firstDayOfWeek: 0,
  dateFormat: "dd/mm/yyyy",
  weak: "חלש",
  medium: "בינוני",
  strong: "חָזָק",
  passwordPrompt: "הכנס סיסמא",
  clear: "נקה"
};
