//https://primefaces.org/primevue/showcase/#/locale

export const primeVueLocale = {
  dayNames: ["ראשון", "שני", "שלישי", "רביעי", "חמישי", "שישי", "שבת"],
  dayNamesShort: ["יום א", "יום ב", "יום ג", "יום ד", "יום ה", "יום ו", "שבת"],
  dayNamesMin: ["יום א", "יום ב", "יום ג", "יום ד", "יום ה", "יום ו", "שבת"],
  monthNames: [
    "ינואר",
    "פברואר",
    "מרץ",
    "אפריל",
    "מאי",
    "יוני",
    "יולי",
    "אוגוסט",
    "ספטמבר",
    "אוקטובר",
    "נובמבר",
    "דצמבר"
  ],
  monthNamesShort: [
    "ינואר",
    "פברואר",
    "מרץ",
    "אפריל",
    "מאי",
    "יוני",
    "יולי",
    "אוגוסט",
    "ספטמבר",
    "אוקטובר",
    "נובמבר",
    "דצמבד"
  ],
  today: "היום",
  clear: "נקה",
  dateFormat: "dd/mm/yy"
};
